{"id":"compute\/v1\/backend\/balancingmode","type":"","title":"Google\\Cloud\\Compute\\V1\\Backend\\BalancingMode","name":"BalancingMode","description":"<p>Specifies the balancing mode for the backend.<\/p>\n<p>When choosing a balancing mode, you need to consider the loadBalancingScheme, and protocol for the backend service, as well as the type of backend (instance group or NEG).<\/p>\n<ul>\n<li>If the load balancing mode is CONNECTION, then the load is spread based on how many concurrent connections the backend can handle.\nYou can use the CONNECTION balancing mode if the protocol for the backend service is SSL, TCP, or UDP.\nIf the loadBalancingScheme for the backend service is EXTERNAL (SSL Proxy and TCP Proxy load balancers), you must also specify exactly one of the following parameters: maxConnections (except for regional managed instance groups), maxConnectionsPerInstance, or maxConnectionsPerEndpoint.\nIf the loadBalancingScheme for the backend service is INTERNAL (internal TCP\/UDP Load Balancers) or EXTERNAL  (Network Load Balancing), you cannot specify any additional parameters.<\/li>\n<li>If the load balancing mode is RATE, the load is spread based on the rate of HTTP requests per second (RPS).\nYou can use the RATE balancing mode if the protocol for the backend service is HTTP, HTTP2, or HTTPS. You must specify exactly one of the following parameters: maxRate (except for regional managed instance groups), maxRatePerInstance, or maxRatePerEndpoint.<\/li>\n<li>If the load balancing mode is UTILIZATION, the load is spread based on the backend utilization of instances in an instance group.\nYou can use the UTILIZATION balancing mode if the loadBalancingScheme of the backend service is EXTERNAL (except Network Load Balancing), INTERNAL_SELF_MANAGED, or INTERNAL_MANAGED and the backends are instance groups. There are no restrictions on the backend service protocol.<\/li>\n<\/ul>\n<p>Protobuf type <code>google.cloud.compute.v1.Backend.BalancingMode<\/code><\/p>","examples":[],"resources":[],"methods":[]}